{"customPackID":"f4f0cc9a-b49b-44bd-bc50-f1cb8e3c8594","customPackName":"Anomalous Gates","listCustomFeats":[{"id":"97745ac1-f820-45da-8e62-deb3be1f2c2b","name":"Animate Ice","level":8,"action":3,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"You sculpt a statue out of ice and breathe a semblance of life into it, allowing it to fight on your side. The ice statue is Small or Medium and appears in an unoccupied space adjacent to you. <br>The ice statue uses your statistics for defenses, and has Hit Points equal to five times your level. It’s mindless and immune to bleed, cold, healing, paralyzed, poison, and sleep. It can't attack except to make a melee Strike, which uses your statistics for a 1-action ranged Elemental Blast using the ice element.<br>The ice statue lasts until the end of your next turn, but you can Sustain it up to 1 minute. When you use the impulse and the first time you Sustain it each round, you can have the ice statue Stride up to 30 feet and make a melee Strike. If you use Animate Ice again, any previous one ends.<br><b>Level (12th)</b> The ice statue can be Small, Medium, or Large.<br><b>Level (16th)</b> The ice statue can be Small, Medium, Large, or Huge.","traits":"Cold, Impulse, Kineticist, Manipulate, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782472"},{"id":"2efca9bf-ea2f-4344-8d12-0f71b4279e3b","name":"Arc Lightning","action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"In a precursor to the dreaded Chain Lightning, electricity arcs from your fingers, leaping to your enemies. Attempt a 2-action ranged Elemental Blast using the lightning element. If you hit, attempt a new ranged Elemental Blast from the target against a different creature that's within the blast's range, measuring from the creature you hit. You can keep chaining the blast in this way each time you hit. All attacks count toward your multiple attack penalty, but it doesn't increase until after all the attacks. You can make up to five blasts total, but you can't target the same creature more than once. Roll damage only once and apply it to each creature you hit.<br><br><b>Special</b> If you have Chain Infusion, when you use Chain Infusion, any blasts in the chain count toward your multiple attack penalty, but it doesn't increase until after all the attacks.","traits":"Electricity, Impulse, Kineticist, Overflow, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"1e00f5c5-6f81-41b2-80b9-6a5a42fb35ea","name":"Arctic Palace of Everlasting Winter","level":18,"action":3,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"You can raise a magnificent building of clear, magically reinforced ice within 10 feet of you. The palace is shaped and decorated as you choose, up to 30 feet in any dimension. You can imagine a purpose for each room of the palace, and the proper accouterments made of ice appear within. Each story must be at least 10 feet tall from floor to ceiling, each 5 feet of the walls must be placed on the border between squares, and the palace is created with its doors open. The magical ice the palace and the accouterments are made of uses the statistics of stone and is unaffected by environmental heat, but melts immediately if taken outside the palace’s walls; the insides of the palace and the magical ice are always pleasantly cool. You and the creatures you designate can walk on the palace's ice as if it was stone, ignoring the uneven ground and difficult terrain. The palace lasts until your next daily preparations, or until you use the Arctic Palace of Everlasting Winter again.<br>As a magical structure, the palace has the structure trait, and it expands outward, so it can’t catch creatures except for you inside it as a magical structure normally does. Instead, it pushes those creatures back. It can’t push a creature into a surface or hazard this way, and stops expanding if that would happen.<br>While inside the palace, you are empowered, dealing an additional 1d6 cold damage with all Strikes, spells that deal cold damage, and impulses that deal cold damage, and gaining a +1 status bonus to Armor Class, attack rolls, and saving throws.<br>You can spend 10 minutes to use the Arctic Palace of Everlasting Winter as an exploration activity; in this case, the palace is permanent, can occupy a space up to 300 feet in any direction, and has no restriction on the size of the floors and the placement of walls, though it still ends if you use the Arctic Palace of Everlasting Winter as an exploration activity again.","traits":"Cold, Impulse, Kineticist, Overflow, Primal, Structure, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782474"},{"id":"f9543410-1d90-4904-ba60-65909817b565","name":"Aura Junction (Ice)","level":5,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"reqSpecials":["Expand The Portal"],"textDescription":"Killing frost stiffens the limbs of foes around you. Any enemy that starts its turn in the aura gets a -10-foot status penalty to its Speeds for 1 round.","traits":"Kineticist, 3rd Party","src":"Rainbow of Elements","databaseID":1,"timestamp":"1728146782472"},{"id":"8f1dbf2b-85e9-4996-8553-45e09166d7b1","name":"Aura Junction (Lightning)","level":5,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"reqSpecials":["Expand The Portal"],"textDescription":"Sparks of electricity energize your allies. The first time an ally that begins its turn in the aura deals damage with a Strike before the end of that turn, they deal an extra 2 electricity damage. This increases to 4 electricity damage if you're 10th level or higher and to 6 electricity damage if you're 15th level or higher.","traits":"Kineticist, 3rd Party","src":"Rainbow of Elements","databaseID":1,"timestamp":"1728146782472"},{"id":"8bfeb931-763e-4218-abf5-70043d9e90b2","name":"Ball Lightning","level":6,"action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"You launch a luminescent sphere of concentrated lightning at a foe, after which it stays hovering in mid-air, ready to suddenly and destructively ram into an enemy. Attempt a 1-action ranged Elemental Blast using the lightning element, leaving a Small crackling sphere in the target creature’s space. When a creature within 15 feet of the sphere uses a manipulate action or a move action, or leaves a square during a move action it's using, you can direct the sphere to it as a reaction with the concentrate trait, attempting a 1-action ranged Elemental Blast using the lightning element against the creature, originating from the sphere’s space. If you critically hit with the Elemental Blast, you disrupt the triggering action. The sphere Flies to the creature’s space during the blast.<br><br>The sphere lasts until the end of your next turn, but you can Sustain it up to 1 minute. Each time you Sustain it, you can have the sphere Fly up to 30 feet.","traits":"Electricity, Impulse, Kineticist, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"4cfc476f-b9c1-4108-b380-5100aa8ba373","name":"Barrier of Boreal Frost (Ice Element)","level":14,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":".","traits":"Kineticist, Impulse, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782472","listCustomEffects":[{"effectType":14,"string0":"KINETICIST_Barrier of Boreal Frost","reference":"c6d9e01f-0499-445a-87fc-ac1bc561b409"}]},{"id":"29c7f270-790a-4f39-ae3c-7b940ffda229","name":"Chain Lightning","level":12,"action":3,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"You unleash a technique that inspired the titular spell, sending a powerful bolt of lightning to jump through your enemies. Target a creature you observe within 30 feet, dealing 6d12 electricity damage with a basic Reflex save against your class DC. The electricity then arcs to another creature within 30 feet of the first target, jumps to another creature within 30 feet of that target, and so on. You can end the chain at any point. You can't target the same creature more than once, and you must have line of effect to all targets. Roll the damage only once and apply it to each target (halving or doubling as appropriate for its saving throw outcome). The chain ends if any one of the targets critically succeeds at its save.<br><br><b>Level (+3)</b> The damage increases by 1d12.","traits":"Electricity, Impulse, Kineticist, Overflow, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"56ca1f8d-d58c-4d31-a849-b5d75bc9f4a5","name":"Cold Comfort","level":12,"action":1,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"Ice gathers around your allies, numbing them to the harshness of the world. You and allies in your kinetic aura gain temporary Hit Points equal to half your level, and again at the start of each of their turns, as well as cold and fire resistance equal to your level. The temporary Hit Points last until the impulse ends. If an enemy hits a creature that has temporary Hit Points from this impulse with a melee unarmed attack or non-reach melee weapon attack, the enemy takes cold damage equal to half your level. Elemental resistance from a gate junction is cumulative with resistance from Cold Comfort.","traits":"Aura, Cold, Impulse, Kineticist, Manipulate, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782475"},{"id":"c59f2eb2-15ca-4ced-9f12-6a30b5a06c29","name":"Critical Blast Junction (Ice)","level":5,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"reqSpecials":["Expand The Portal"],"textDescription":"If the target of the critical hit is adjacent to a surface, it gets frozen to the surface. The target is immobilized and must spend an Interact action to attempt a DC 10 Athletics check to tear itself free. The creature doesn't get frozen if it's incorporeal or could otherwise escape without effort.","traits":"Kineticist, 3rd Party","src":"Rainbow of Elements","databaseID":1,"timestamp":"1728146782472"},{"id":"bddddfca-d72a-45f5-8c76-ed8f217dbda6","name":"Critical Blast Junction (Lightning)","level":5,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"reqSpecials":["Expand The Portal"],"textDescription":"Electricity arcs to deal electricity damage equal to the damage dice of the blast to one other creature of your choice within 10 feet of the target. This amount isn't doubled, and no bonuses or other additional dice apply to this damage.","traits":"Kineticist, 3rd Party","src":"Rainbow of Elements","databaseID":1,"timestamp":"1728146782472"},{"id":"d95f8061-4a72-49db-8ea7-581b6ae560f3","name":"Crowned in Tempest's Fury (Lightning Element)","level":18,"action":1,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"You become one with a devastating thunderstorm from the Plane of Air, placing a crown of lightning upon your brow. Sparks flash in your eyes, and lightning strikes constantly in the air around you as howling winds lift you from the ground.<br><br><ul><li>Any creature that enters your kinetic aura or ends its turn there takes 2d12 electricity damage.</li><br><li>If you don't have a fly Speed, you gain a 20-foot fly Speed. If you have the Cyclonic Ascent impulse, you instead gain that fly Speed and the extra benefits.</li><br><li>You gain a +10-foot status bonus to all your Speeds.</li><br><li>Your air Elemental Blasts deal an additional 1d12 electricity damage.</li></ul>","traits":"Air, Electricity, Impulse, Kineticist, Primal, Stance, 3rd Party","src":"Custom","databaseID":1},{"id":"693b567b-8b93-4785-a209-bb498e3d1f7b","name":"Cyclonic Ascent (Lightning Element)","level":8,"action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"Whorls of wind surround your lower body, forming a cyclone that lifts you into the air. You gain a fly Speed equal to your land Speed or 30 feet, whichever is greater, for 10 minutes. Unlike with a normal fly Speed, you can move upward without treating it as difficult terrain. In addition, you can remain in the air at the end of your turn if you used an air impulse during that turn, even if you didn't use a Fly action that turn.<br><br><b>Level (14th)</b> You can target up to five additional creatures, each of which gains a fly Speed equal to its land Speed or 30 feet, whichever is greater. They don't gain the other benefits.","traits":"Air, Impulse, Kineticist, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"b2530adb-708c-4231-b936-f437a9e8b7ed","name":"Defibrillation","action":1,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"A small shock is more than enough to keep an ally going. Touch a living creature. It gains temporary Hit Points equal to your level and a +10-foot status bonus to its Speed for 1 round. If it’s dying, it regains 1 Hit Point and increases its wounded condition as normal, and becomes temporarily immune to healing from Defibrillation for 10 minutes.<br><br><b>Level (+6)</b> The status bonus to Speed increases by 5 feet.","traits":"Electricity, Healing, Impulse, Kineticist, Manipulate, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"92a00442-cb91-4a92-8ae9-b2c94141d07f","name":"Electromuscular Stimulation","level":6,"action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"You send a stimulating shock to your allies’ muscles, propelling them to action. Target up to four willing creatures within 30 feet of you. They gain the quickened condition for 1 round and can use the extra action only to Step or Stride. If they choose to use the additional action from the quickened condition granted by the impulse, they also take electricity damage equal to half their level from excessive stimulation. This damage ignores resistances.<br><br><b>Level (12th)</b> The targets can use the extra action to Strike.","traits":"Electricity, Impulse, Kineticist, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"d07f3efd-5ea8-4027-a300-fbc253ed4838","name":"Elemental Resistance (Ice)","level":5,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"reqSpecials":["Expand The Portal"],"textDescription":"cold, fire","traits":"Kineticist, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782472","listCustomEffects":[{"proficiencyName":"Cold","effectType":12,"bonusType":2},{"proficiencyName":"Fire","effectType":12,"bonusType":2}]},{"id":"e3435d17-06af-4427-9be4-25d79a9b7d7a","name":"Elemental Resistance (Lightning)","level":5,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"reqSpecials":["Expand The Portal"],"textDescription":"electricity, sonic","traits":"Kineticist, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782472","listCustomEffects":[{"proficiencyName":"Electricity","effectType":12,"bonusType":2},{"proficiencyName":"Sonic","effectType":12,"bonusType":2}]},{"id":"7346b6ff-3198-4df1-8179-1cb7bd3a6ea3","name":"Fimbulvetr","level":18,"action":3,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"You summon deadly, apocalyptic winter, freezing everything around you. You are surrounded by an aura of winter in a 100-foot emanation, filled with howling wind, blinding snow, and freezing chill. All creatures in the aura are concealed, and all creatures outside the aura become concealed to creatures within it. The wind and show in the aura impede movement, making the area difficult terrain. You’re immune to the concealment and difficult terrain from Fimbulvetr. <br>The impulse lasts until the end of your next turn, and you can Sustain the impulse up to 1 minute. When you use the impulse and the first time you Sustain it each round, each enemy in the aura takes 8d6 cold damage with a basic Reflex save against your class DC.<br><b>Level (20th)</b> The damage increases to 10d6. ","traits":"Aura, Cold, Impulse, Kineticist, Overflow, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782475"},{"id":"507217cf-2f03-4567-89ce-b94bc4734d43","name":"Flashfrost Gate","level":6,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"A small doorway directly to the heart of everlasting winter opens but for a fleeting moment, sucking all heat from everything around it. Each creature in a 15-foot burst within 90 feet takes 3d10 cold damage with a basic Fortitude save against your class DC. A creature that critically fails its save is drained 1.<br><b>Level (+2)</b> The damage increases by 1d10.","traits":"Cold, Impulse, Kineticist, Overflow, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782475"},{"id":"c362c6f6-c4b0-4004-9510-01dac018e2fa","name":"Frozen Heart","level":8,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"You channel the lethal frost directly through your enemy’s flesh, starting from its heart. Target a creature you can observe within 30 feet. It takes 6d8 cold damage with a basic Fortitude save against your class DC, and is drained 1 on a failure or drained 2 on a critical failure. <br>If the target’s level is equal to or lower than your level – 4 and it fails the save, it dies instantly. A foe killed by this impulse turns into a statue of ice.<br><b>Level (+2)</b> The cold damage increases by 1d8.","traits":"Cold, Death, Impulse, Kineticist, Overflow, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782475"},{"id":"2b7ae996-9950-41fd-a43a-2a37ace31c04","name":"Ghosts in the Storm (Lightning Element)","level":12,"action":1,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"Clouds, like eager pets, are drawn to you and to those in your good graces. Fast-moving gray clouds surround you, as well as your allies while they're in your kinetic aura. Anyone surrounded by these clouds gains a +2 status bonus to Reflex saves and Acrobatics checks. When an affected creature uses a move action, clouds dance around it. Until the start of its next turn, it's concealed, and its Strikes gain the shock rune.","traits":"Air, Electricity, Impulse, Kineticist, Primal, Stance, 3rd Party","src":"Custom","databaseID":1},{"id":"a1014ea4-7915-48aa-af25-a201d74481e2","name":"Glacial Prison (Ice Element)","level":12,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":".","traits":"Kineticist, Impulse, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782473","listCustomEffects":[{"effectType":14,"string0":"KINETICIST_Glacial Prison","reference":"1f190e9c-5031-4b0b-a902-986dcb5341e2"}]},{"id":"317ef6cd-365f-4ee3-8ecf-b5d7b26eed21","name":"Hail Blast","action":2,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"Small shards of ice form in the sky, falling on your foes. Each creature in a 10-foot radius, 30-foot-tall cylinder within 60 feet of you takes 1d4 cold damage and 1d4 piercing damage with a basic Reflex save against your class DC.<br>Level (+2) Each type of damage increases by 1d4.","traits":"Cold, Impulse, Kineticist, Overflow, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782475"},{"id":"85877d9e-3b12-462e-9dd4-a80895c16234","name":"Hiemal Blade","level":4,"action":3,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"You gather the frost surrounding you into a colossal bladed weapon and rush, scything through your foes. Step or Stride up to 15 feet. At any point during the movement, you may attempt a 2-action melee Elemental Blast using the ice element, adding an additional 1 cold damage, and compare the attack roll result to the AC of up to two foes, each of whom must be within your melee reach and adjacent to each other. Roll damage only once and apply it to each creature you hit. A Hiemal Blade counts as two attacks for your multiple attack penalty. <br>You may treat Hiemal Blade as a melee Elemental Blast for purposes of Weapon Infusion, and if you add the sweep trait with the Weapon Infusion, its modifier applies to all your Hiemal Blade attacks.<br>Level (+3) The additional cold damage increases by 1d8 and the maximum length of the Stride increases by 5 feet.","traits":"Attack, Cold, Impulse, Kineticist, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782475"},{"id":"ea9fac6c-adeb-4352-a156-d9b58251257d","name":"Ice Armor","action":2,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"Sheets of brittle ice cover you like armor. This ice armor is medium armor but uses your highest armor proficiency. The ice armor’s statistics are: <i>AC</i> Bonus +3; <i>Dex Cap</i> +2; <i>Check Penalty</i> –2; <i>Speed Penalty</i> –5 feet; <i>Strength</i> 2; <i>Bulk</i> 2; <i>Group</i> composite; <i>Armor Traits</i> laminar. Any bonuses, runes, and magical abilities of your actual armor are suppressed, but any that could apply to the ice armor are replicated onto it. <br>As a reaction, when an enemy within melee reach hits you with a Strike, you may deal 1d4 cold damage with a basic Reflex save against your class DC to the triggering enemy as the sheets of ice explode in its face. If less than 1 round passed since you used the reaction, the ice armor gains the broken condition, or is destroyed if it was already broken. <br>The impulse lasts for 10 minutes, and you can Dismiss this impulse. If you use this impulse again, any existing one ends. <br>Level (+3) The damage increases by 1d4. ","traits":"Cold, Impulse, Kineticist, Primal, 3rd Party","src":"Anomalous Gates","databaseID":1,"timestamp":"1728146782473"},{"id":"25849370-aff9-4dae-8369-f374c35ca88f","name":"Ice Barrier","level":6,"action":0,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"Trigger A creature hits you with an attack and you can see the attacker<br>You conjure a thin sheet of ice between you and the triggering enemy, deflecting the blow and gaining a +2 circumstance bonus to AC against the triggering attack. If the attack still hits you, the sheet shatters, blunting the strike, and you gain resistance to fire or physical damage from the triggering attack equal to half your level. If the effect deals more than one applicable type of damage, apply the resistance only once. If you’re under the Ice Armor impulse, you may use its reaction as part of this impulse","traits":"Cold, Impulse, Kineticist, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782473"},{"id":"61b3139c-10c5-4078-93cc-a6f93983ca64","name":"Ice Element (Anomalous Gates)","textDescription":"You draw your power from an isolated pocket in the Plane of Water, perhaps near the border with the Plane of Air, where violent winds may freeze your flesh solid before eroding it away or great glacier islands house ecosystems of ice elementals and stranger creatures still. <br><b>Impulse Junction</b> Snow flutters around you, causing you to become concealed for 1 round. <br><b>Blast Damage</b> 1d8 cold or piercing, 30 foot range. <br><b>Extract Element</b> cold <br><b>Critical Blast Junction</b> If the target of the critical hit is adjacent to a surface, it gets frozen to the surface. The target is immobilized and must spend an Interact action to attempt a DC 10 Athletics check to tear itself free. The creature doesn't get frozen if it's incorporeal or could otherwise escape without effort. <br><b>Elemental Resistance</b> cold, fire <br><b>Aura Junction</b> Killing frost stiffens the limbs of foes around you. Any enemy that starts its turn in the aura gets a -10-foot status penalty to its Speeds for 1 round. <br><b>Skill Junction</b> Stealth, Terrain Stalker (snow)  <br><b>Versatile Blast</b> bludgeoning <br><b>Elemental Form</b> <i>Ice</i> 25 feet, ice burrow 20 ft; cold resistance 10, weakness 5 to fire; <b>Melee</b> � claw (Strength based), <b>Damage</b> 1d10 slashing plus 1d8 cold <b>Gate Attenuator Spells 1st</b> <i>snowball</i>; <b>5th</b> <i>howling blizzard</i>; <b>8th</b> <i>arctic rift</i>; <br> <b> Additional impulses: </b> <b>1st</b> Winter’s Clutch, <b>4th</b> Winter Sleet, <b>12th</b> Glacial Prison, <b>14th</b> Barrier of Boreal Frost.","traits":"Kineticist, 3rd Party","src":"Anomalous Gates","databaseID":1,"timestamp":"1728146782473"},{"id":"23aac157-1f71-4c10-886d-53007dc8fc33","name":"Ice Sculpture","action":2,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"You can create a permanent ice object, either sculpting ice pulled directly from your kinetic gate or manipulating ice and snow around you. It must fit within one 5-foot cube that's adjacent to you and on solid ground, and you can make the object large enough to occupy the square. If you create the object underneath you or another willing creature, you cause the target to rise on top of the object; you can't create it under an unwilling creature. This impulse has an unlimited duration and the resulting object is protected from environmental heat, but if you use Ice Sculpture again, the object thaws or shatters immediately. You can spend 1 hour to use Ice Sculpture as an exploration activity; in this case, the object is permanent and non-magical, and thaws normally. The object can't include any intricate parts or moving pieces. You can attempt a Crafting skill check as part of using this impulse to add details to your creation, such as a symbol, short message, or pattern (with the DC determined by the GM).<br><b>Level (+3)</b> You can add an additional 5-foot cube to the object. Each cube must be contiguous.","traits":"Cold, Impulse, Kineticist, Manipulate, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782474"},{"id":"ecd89850-ae95-4fe2-b0c8-5c5d254cd7a7","name":"Impulse Junction (Ice)","level":5,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"reqSpecials":["Expand The Portal"],"textDescription":"Snow flutters around you, causing you to become concealed for 1 round.","traits":"Kineticist, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782474"},{"id":"b0cfe876-54c5-4109-a484-f034906f27eb","name":"Impulse Junction (Lightning)","level":5,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"reqSpecials":["Expand The Portal"],"textDescription":"Lightning After the impulse’s other effects, you can leave a static charge in one creature damaged by the impulse. Until the end of your next turn, the next time it takes electricity damage, it takes an additional electricity damage equal to your level.","traits":"Kineticist, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782474"},{"id":"bb269821-15fa-4a9e-8e04-e5733ddcd3b8","name":"It’s Alive!","level":14,"action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"You open a gate to the intersection of the Plane of Air and Creation’s Forge, blasting an ally with a bolt of vital lightning. This has the effect of a <i>shock to the system</i> spell with a spell rank equal to half your level rounded up.<br><br>Each creature that benefited from this impulse becomes temporarily immune to It’s Alive! for an hour, or until your next daily preparations if the creature was revived by the impulse.","traits":"Air, Electricity, Healing, Impulse, Kineticist, Manipulate, Overflow, Primal, Vitality, 3rd Party","src":"Custom","databaseID":1},{"id":"a34f7709-0523-418d-beae-35fad321feb9","name":"Lightning Dash (Lightning Element)","level":4,"action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"For an instant, you transform yourself into a being of pure lightning and fly forward, shocking anyone in your way. You propel yourself forward in a 30-foot line. You can move through creatures during this movement, and this movement doesn't trigger reactions that are triggered by movement. Each creature you move through takes 2d12 electricity damage with a basic Reflex save against your class DC. You return to your normal form in the final square of the line. If you're in the air, you fall unless you have a fly Speed.<br><br><b>Level (+3)</b> The length of the line increases by 5 feet, and the damage increases by 1d12.","traits":"Air, Electricity, Impulse, Kineticist, Move, Overflow, Polymorph, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"2e06a714-ccf4-4823-8035-cfc833671c22","name":"Lightning Element (Anomalous Gates)","textDescription":"You draw your power from a great nexus of thunder and lightning in the Plane of Air. Perhaps you accessed the Eternal Storm Clouds churning between the Air and Water Planes, rising ever greater after the Plane of Wood’s reappearance, or even Ranginori’s Roaring Spark, drawing upon errant jolts of the Zephyrous Prince’s divine lightning. <br><b>Impulse Junction</b> After the impulse’s other effects, you can leave a static charge in one creature damaged by the impulse. Until the end of your next turn, the next time it takes electricity damage, it takes an additional electricity damage equal to your level. <br><b>Blast Damage</b> 1d6 electricity, 60 foot range. <br><b>Extract Element</b> lightning<br><b>Critical Blast Junction</b> Electricity arcs to deal electricity damage equal to the damage dice of the blast to one other creature of your choice within 10 feet of the target. This amount isn't doubled, and no bonuses or other additional dice apply to this damage.<br><b>Elemental Resistance</b> electricity, sonic<br><b>Aura Junction</b> Sparks of electricity energize your allies. The first time an ally that begins its turn in the aura deals damage with a Strike before the end of that turn, they deal an extra 2 electricity damage. This increases to 4 electricity damage if you're 10th level or higher and to 6 electricity damage if you're 15th level or higher.<br><b>Skill Junction</b> Acrobatics, Cat Fall<br><b>Versatile Blast</b> sonic<br><b>Elemental Form</b> <i>Lightning</i> fly 60 feet, movement doesn't trigger reactions; <b>Melee</b> [1-action] spark (Dexterity based), <b>Damage</b> 1d8 electricity<b>Gate Attenuator Spells 1st</b> <i>horizon thunder sphere</i>; <b>5th</b> <i>lightning form</i>; <b>8th</b> <i>chain lightning</i>; <br><b>Additional impulses: </b> <b>4th</b> Lightning Dash, <b>8th</b> Ghosts in the Storm, Storm Spiral, <b>12th</b> Cyclonic Ascent, <b>14th</b> Crowned in Tempest's Fury.","traits":"Kineticist, 3rd Party","src":"Anomalous Gates","databaseID":1,"timestamp":"1728146782473"},{"id":"c8def599-f651-4e35-b1d6-33cd4d0940ba","name":"Lightning Spear","action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"You form a spear of coruscating lightning in your hand, launching it at your enemy. Each creature in a 5-foot burst within 30 feet takes 1d12 electricity damage with a basic Reflex save against your class DC. If your last action included a melee Elemental Blast using the lightning element against a creature targeted by the impulse, you form the spear around the blast, imposing a -1 circumstance penalty to its save; the penalty is –2 if the creature also has the metal trait, is made of metal, or is wearing metal armor.<br><br><b>Level (+3)</b> The damage increases by 1d12.","traits":"Electricity, Impulse, Kineticist, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"c33ab43c-36d3-4a99-993e-311844552911","name":"Redirect Lightning","action":0,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"<b>Trigger</b> You would take electricity damage from an enemy's attack, spell, or other hostile effect.<br><b>Requirements</b> You're aware of the hostile effect, and you aren't off-guard against it.<br><br>You let the lightning course through your body before discharging it back at your enemies. You gain resistance equal to double your level to electricity damage from the triggering effect and immediately attempt a 1-action melee or ranged Elemental Blast using the lightning element. Elemental resistance from a gate junction is cumulative with resistance from Redirect Lightning.","traits":"Electricity, Impulse, Kineticist, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"85a1be0d-f0a3-47a4-bf4f-84304055576a","name":"Skill Junction (Ice)","level":5,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"reqSpecials":["Expand The Portal"],"textDescription":"Stealth, Terrain Stalker (snow)","traits":"Kineticist, 3rd Party","src":"Rainbow of Elements","databaseID":1,"timestamp":"1728146782474","listCustomEffects":[{"effectType":14,"string0":"GENERAL_Terrain Stalker","reference":"bf28579c-0676-45c1-a4af-b0b7c40e6296"},{"proficiencyName":"Stealth","effectType":11,"bonusAmount":2}]},{"id":"b6050d9e-e074-4de6-95f2-67ca01b3cc8f","name":"Skill Junction (Lightning)","level":5,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"reqSpecials":["Expand The Portal"],"textDescription":"Acrobatics, Cat Fall","traits":"Kineticist, 3rd Party","src":"Rainbow of Elements","databaseID":1,"timestamp":"1728146782474","listCustomEffects":[{"effectType":14,"string0":"GENERAL_Terrain Stalker","reference":"ebea7185-9a60-4301-a3d7-1010ce97f002"},{"proficiencyName":"Stealth","effectType":11,"bonusAmount":2}]},{"id":"e954aa5b-d57a-4a54-a297-0d9847633cf5","name":"Storm Spiral","level":8,"action":3,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"Dark thunderclouds swirl in a miniature storm, crisscrossed with lightning bolts; a tremendous thunderclap fills the air. The storm appears in a 20-foot burst within 60 feet. Each creature in the area takes 3d12 electricity damage and 1d10 sonic damage, with a basic Reflex save against your class DC. A creature that fails its save is deafened until the end of its next turn (or for 1 minute on a critical failure). A creature wearing metal armor or made of metal takes a –1 circumstance penalty to its save.<br><br><b>Level (+3)</b> The electricity damage increases by 1d12.","traits":"Air, Electricity, Impulse, Kineticist, Overflow, Primal, Sonic, 3rd Party","src":"Custom","databaseID":1},{"id":"117cadc2-bd69-478f-a1d7-18858f24a2ff","name":"Sunder the Skies","level":18,"action":2,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"Stormclouds gather in the sky above you, erupting with a volley of overwhelmingly powerful lightning bolts. Each creature in a 40-foot radius, 10-mile-tall cylinder within 500 feet of you takes 8d12 lightning damage with a basic Reflex save against your class DC. On a failure, it’s stunned 1, and on a critical failure, it’s stunned 2.<br><br><b>Level (20th)</b> The damage is 9d12.","traits":"Electricity, Impulse, Kineticist, Overflow, Primal, 3rd Party","src":"Custom","databaseID":1},{"id":"cb908d31-9cbc-4d95-81f1-6258c4c38d93","name":"Voltaic Cascade","level":4,"action":1,"reqFeats":["2e06a714-ccf4-4823-8035-cfc833671c22"],"textDescription":"You let the raging lightning build up in your body before catastrophically discharging it. You gain an internal pool of lightning called a voltaic reservoir, which begins with a value equal to half your level. At the start of each of your turns, increase your reservoir by half your level. If a creature damages you with an attack or spell while it's within your kinetic aura, that creature takes electricity damage equal to half your voltaic reservoir value. It takes this damage only the first time it damages you in a round.<br><br>You can Dismiss the stance. When the stance ends, whether by Dismissing it or by using an overflow impulse, you can discharge the reservoir, dealing electricity damage equal to your voltaic reservoir value to all creatures in your kinetic aura or, if you used an overflow impulse, to all creatures damaged by the impulse.","traits":"Aura, Electricity, Impulse, Kineticist, Primal, Stance, 3rd Party","src":"Custom","databaseID":1},{"id":"b01186b9-c011-4fc1-9caf-c4c53cac7485","name":"Winter Sleet (Ice Element)","level":4,"action":1,"reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":"Bone-chilling, swirling sleet surrounds you, cruel as deepest winter. Surfaces in your kinetic aura are coated in slippery ice. A creature that moves on the ice immediately falls unless it succeeds at an Acrobatics check or Reflex save against your impulse DC – 2. A creature that Steps or Crawls doesn’t have to attempt a check or save. You’re immune to this effect.<br><br>If a creature on the ice is critically hit by one of your water impulses or critically fails at a save against one, that creature is slowed 1 until the end of its next turn.","traits":"Cold, Impulse, Kineticist, Primal, Stance, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782474","listCustomEffects":[{"effectType":14,"string0":"KINETICIST_Winter Sleet","reference":"5413992c-c546-4728-bd17-a862d8de39ff"}]},{"id":"6fbcefc8-3dee-4498-a95c-b86ef535a77c","name":"Winter's Clutch","reqFeats":["61b3139c-10c5-4078-93cc-a6f93983ca64"],"textDescription":".","traits":"Kineticist, Ice, Impulse, Cold, Primal, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1728146782475","listCustomEffects":[{"effectType":14,"string0":"KINETICIST_Winter's Clutch","reference":"db9d3d55-8545-4203-98d9-6b7dc1da277b"}]}]}